Repository: SH-Amida/Wootrix2
Catalog: Wootrix/Resources/Views.Home.Index.*.resx
Languages: es

source: Bronze Package
es: Paquete Bronce

source: By Signing up, you are agreeing to Wootrix Terms and Privacy
es: Ao se inscrever, você concorda com os Termos e a Privacidade da Wootrix.

source: Contact us through email
es: Contáctenos a través de correo electrónico

source: Curatorial platform, with user-friendly appearance.
es: Plataforma de curaduría, con apariencia amigable al usuario.

source: Custom Magazines
es: Revistas personalizadas

source: Customize your post
es: Personalizar su publicación

source: Department Filters
es: Filtros de Departamento

source: Determine the topics and languages ​​of your interest and our algorithms put together a free digital magazine tailored for you.
es: Determine los temas y los idiomas de su interés y nuestros algoritmos montan una revista digital gratuita a medida para usted.

source: Enter with
es: Entre com

source: Gold Package
es: Paquete Oro

source: Home
es: Casa

source: Login
es: Entrar

source: Manage Companies
es: Gerenciar Empresas

source: Manage Company Admins
es: Gerenciar administradores da empresa

source: Need more users?
es: ¿Necesitas más usuarios?

source: Prices and Plans
es: Precios y Planes

source: Silver Package
es: Pacote Prata

source: The smart way to find and distribute knowledge.
es: La manera inteligente de encontrar y distribuir conocimiento.

source: Through a modern, beautiful and easy-to-read layout, the platform guides you to minutely selected relevant content.
es: A través de un diseño moderno, bonito y de fácil lectura, la plataforma le dirige a contenidos relevantes minuciosamente seleccionados.

source: Up to
es: hasta

source: users
es: usuarios

source: per month
es: por mes

source: You can be invited to read magazines of companies, universities, entities and etc, have access to a 24x7 channel containing news, case studies, product catalogs, releases and more. Always free to the reader.
es: Usted podrá ser invitado a leer revistas de empresas, universidades, entidades y etc, tener acceso a un canal 24x7 conteniendo noticias, casos de éxito, catálogos de productos, lanzamientos y mucho más. Siempre gratis para el lector.

source: Bring your content to your audience with ease
es: Lleva tu contenido a tu audiencia con facilidad
